; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image5 - mode
	infrared1 - mode
	spectrograph2 - mode
	image0 - mode
	image4 - mode
	spectrograph3 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star3 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star3)
	(supports instrument1 image4)
	(calibration_target instrument1 Star7)
	(supports instrument2 spectrograph2)
	(supports instrument2 image5)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 image4)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite1 Star10)
	(have_image Planet8 image4)
	(have_image Planet8 image0)
	(have_image Star9 spectrograph3)
	(have_image Star10 spectrograph2)
	(have_image Star10 infrared1)
	(have_image Star11 spectrograph2)
	(have_image Star11 image0)
	(have_image Star12 spectrograph3)
	(have_image Star12 infrared1)
))

)

; plan
1. (turn_to satellite1 star3 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star3)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 planet8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet8)
   goals met: 0 of 10
5. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 0 of 10
6. (take_image satellite1 planet8 instrument3 image4)
   added: (have_image planet8 image4)
   goals met: 1 of 10
7. (take_image satellite1 planet8 instrument3 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 10
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 10
9. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 2 of 10
10. (turn_to satellite0 star10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star10)
   goals met: 2 of 10
11. (take_image satellite0 star10 instrument2 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 3 of 10
12. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 3 of 10
13. (take_image satellite0 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 4 of 10
14. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 4 of 10
15. (take_image satellite0 star12 instrument2 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 5 of 10
16. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 5 of 10
17. (take_image satellite0 star9 instrument2 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 6 of 10
18. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 6 of 10
19. (take_image satellite1 star11 instrument3 image0)
   added: (have_image star11 image0)
   goals met: 7 of 10
20. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 7 of 10
21. (take_image satellite1 star12 instrument3 infrared1)
   added: (have_image star12 infrared1)
   goals met: 8 of 10
22. (turn_to satellite1 star10 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star10)
   goals met: 9 of 10
23. (take_image satellite1 star10 instrument3 infrared1)
   added: (have_image star10 infrared1)
   goals met: 10 of 10
